git.org
* check my git is old ( good ) enough

sudo yum install git -y
git --version

* if git old enough

cd /usr/local/src
sudo yum install perl-ExtUtils-MakeMaker -y;sudo make prefix=/usr/local all
git clone https://github.com/msysgit/git.git
cd git
make prefix=/usr/local all
sudo make prefix=/usr/local install
sudo rpm -e git  perl-Git
ln -s /usr/local/bin/git /usr/bin/git (or add /usr/local/bin to PATH from .bash_profile)
git --version

* clone

cd
git clone https://github.com/taeyoungchoon/taeyoungchoon.github.io.git
cd taeyoungchoon.github.io
git status

* init

git config user.name "taeyoungchoon" (am I right?)
git config user.email "taeyoungchoon@gmail.com"
git commit -m 'mod git the add bash'
git config --global push.default simple
git config --global credential.helper store (but where?)
git push

* daily

- git pull
- emacs foo.org
- git status
- git add foo.org
- git commit -m "add foo.org"
- git push

* suggest 

- auto aka background
