git.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>git</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="git"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2014-09-26T09:23+0900"/>
<meta name="author" content=""/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>



</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">git</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 check my git is old ( good ) enough</a></li>
<li><a href="#sec-2">2 if git old enough</a></li>
<li><a href="#sec-3">3 clone</a></li>
<li><a href="#sec-4">4 init</a></li>
<li><a href="#sec-5">5 daily</a></li>
<li><a href="#sec-6">6 suggest</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> check my git is old ( good ) enough</h2>
<div class="outline-text-2" id="text-1">





<pre class="example">sudo yum install git -y
git --version
</pre>


</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> if git old enough</h2>
<div class="outline-text-2" id="text-2">





<pre class="example">cd /usr/local/src
sudo yum install perl-ExtUtils-MakeMaker -y;sudo make prefix=/usr/local all
git clone https://github.com/msysgit/git.git
cd git
make prefix=/usr/local all
sudo make prefix=/usr/local install
sudo rpm -e git  perl-Git
ln -s /usr/local/bin/git /usr/bin/git (or add /usr/local/bin to PATH from .bash_profile)
git --version
</pre>


</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> clone</h2>
<div class="outline-text-2" id="text-3">





<pre class="example">cd
git clone https://github.com/taeyoungchoon/taeyoungchoon.github.io.git
cd taeyoungchoon.github.io
git status
</pre>


</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> init</h2>
<div class="outline-text-2" id="text-4">





<pre class="example">git config user.name "taeyoungchoon" (am I right?)
git config user.email "taeyoungchoon@gmail.com"
git commit -m 'mod git the add bash'
git config --global push.default simple
git config --global credential.helper store (but where?)
git push
</pre>


</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> daily</h2>
<div class="outline-text-2" id="text-5">





<pre class="example">git pull 
emacs foo.org
git status
git add foo.org
git commit -m "add foo.org"
git push
</pre>


</div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> suggest</h2>
<div class="outline-text-2" id="text-6">


<ul>
<li>auto aka background
</li>
</ul>

</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2014-09-26T09:23+0900</p>
<p class="author">Author: </p>
<p class="creator"><a href="http://orgmode.org">Org</a> version 7.9.3f with <a href="http://www.gnu.org/software/emacs/">Emacs</a> version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
